<a href="https://colab.research.google.com/github/fereshtehdehkhoda/Example-17-Female-26/blob/main/Female_and_26.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Female & >26

In [ ]:
#چند درصد مشتریان زن، بالای 26 سال سن دارند؟

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data=pd.read_csv('sample_data.csv')

In [ ]:
data.head()

,id,sex,is_employed,income,marital_status,health_insurance,housing_type,recent_move,num_vehicles,age,state_of_res
0,2068,F,False,11300.0,Married,True,Homeowner free and clear,False,2.0,49.0,Michigan
1,2073,F,False,0.0,Married,True,Rented,True,3.0,40.0,Florida
2,2848,M,True,45000.0,Never Married,False,Rented,True,3.0,29.0,Georgia
3,5641,M,True,20000.0,Never Married,False,Occupied with no rent,False,0.0,22.0,New Mexico
4,6369,F,True,42000.0,Never Married,True,Rented,True,1.0,31.0,Florida

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                500 non-null    int64
 1   sex               500 non-null    object
 2   is_employed       435 non-null    object
 3   income            493 non-null    float64
 4   marital_status    500 non-null    object
 5   health_insurance  500 non-null    bool
 6   housing_type      466 non-null    object
 7   recent_move       466 non-null    object
 8   num_vehicles      466 non-null    float64
 9   age               500 non-null    float64
 10  state_of_res      500 non-null    object
dtypes: bool(1), float64(3), int64(1), object(6)
memory usage: 39.7+ KB

In [ ]:
np.sum((data['sex']=='F') & (data['age']>26))/np.sum(data['sex']=='F')*100

93.36283185840708